# Лабораторна робота No1
# Тема: Основи роботи з Python: змінні, типи даних та операції
# Варіант 8 (Програма для визначення більшого з двох чисел.)

# Введення першого числа з клавіатури
num1 = float(input("Введіть перше число: "))

# Введення другого числа з клавіатури
num2 = float(input("Введіть друге число: "))


print("Додавання:", num1 + num2) # Обчислення і виведення суми двох чисел
print("Віднімання:", num1 - num2) # Обчислення і виведення різниці двох чисел
print("Множення:", num1 * num2) # Обчислення і виведення добутку двох чисел

#Перевірка на ділення на 0
if num2 != 0:
    print("Ділення:", num1 / num2) # Обчислення і виведення ділення двох чисел
else:
    print("Ділити на 0 не можнв!")

# Визначення і виведення більшого з двох чисел
if num1 > num2:
    print(num1, "більше за", num2)
elif num2 > num1:
    print(num2, "більше за", num1)
else:
    print("Числа рівні")

# Визначення і виведення більшого з двох чисел
print("Між числом", num1, "та", num2, "більшим є", num1 if num1 > num2 else num2)
