# Лабораторна 4
# Тема: Використання функцій та параметрів у мові програмування Python
# Загальне завдання: Написати програму, яка реалізує функцію для обчислення за
# індивідуальним варіантом. Функцію необхідно викликати для кількох різних значень та вивести
# результати на екран.
# Варіант 8 Реалізувати функцію для знаходження найбільшого з трьох чисел.

# Функція знаходить найбільше з трьох чисел.
def max_of_three(a, b, c):
    if a >= b and a >= c:
        return a
    elif b >= a and b >= c:
        return b
    else:
        return c

def main():
    # Виклик для кількох різних значень
    print(f"Тест 1 (10, 20, 15): {max_of_three(10, 20, 15)}")
    print(f"Тест 2 (5, 5, 2): {max_of_three(5, 5, 2)}")
    print(f"Тест 3 (-1, -5, -3): {max_of_three(-1, -5, -3)}")

    # Введення даних користувачем
    num1 = float(input("Введіть перше число: "))
    num2 = float(input("Введіть друге число: "))
    num3 = float(input("Введіть третє число: "))

    # Виведення результату
    result = max_of_three(num1, num2, num3)
    print(f"Найбільше число = {result}")

# Перевірка прямого запуску файлу
if __name__ == "__main__":
    main()

