# Лабораторна 3
# Тема: Робота зі списками та словниками в мові програмування Python.
# Загальне завдання: Написати програму, яка:
# − вводить початкові дані списку/словника;
# − обчислює результат;
# − виводить результат.
# Варіант 8 Реалізувати програму для перевірки, чи є два списки однаковими.

# Користувач вводить дані через пробіл
print("Введіть елементи першого списку через пробіл:")
list_1 = input().split()

# Користувач вводить дані через пробіл
print("Введіть елементи другого списку через пробіл:")
list_2 = input().split()

# Виводяться списки
print("Список перший: ", list_1)
print("Список другий: ", list_2)

# Порівняння
if list_1 == list_2:
    print("Списки однакові")
else:
    print("Списки різні")
